Martinius79/esp32cam-demo/src/main.cpp
/*******************************************************************************************************************
*
*                         ESP32Cam development board demo sketch using Arduino IDE or PlatformIO
*                                   Github: https://github.com/alanesq/ESP32Cam-demo
*
*                         Tested with ESP32 board manager version 3.1.1, Arduino IDE 2.3.4
*
*     Starting point sketch for projects using the esp32cam development board with the following features
*        web server with live video streaming and RGB data from camera demonstrated.
*        sd card support using 1-bit mode (data pins are usually 2,4,12&13 but using 1bit mode only uses pin 2)
*        flash led is still available for use (pin 4) and does not flash when accessing sd card
*        Stores image in Spiffs if no sd card present
*        PWM control of the illumination/flash LED
* 
*     If ota.h file is in the sketch folder you can enable OTA updating of this sketch by setting '#define ENABLE_OTA 1'
*        in settings section.  You can then update the sketch with a BIN file via OTA by accessing page   http://x.x.x.x/ota
*        This can make updating the sketch more convenient, especially if you have installed the camera in a case etc.
*
*     GPIO:
*        You can use io pins 13 and 12 for input or output (but 12 must not be high at boot)
*        You could also use pins 1 & 3 if you do not use Serial (disable serialDebug in the settings below)
*        Pins 14, 2 & 15 should be ok to use if you are not using an SD Card
*        More info:   https://randomnerdtutorials.com/esp32-cam-ai-thinker-pinout/
*
*     You can use a MCP23017 io expander chip to give 16 gpio lines by enabling 'useMCP23017' in the setup section and connecting
*        the i2c pins to 12 and 13 on the esp32cam module.  Note: this requires the adafruit MCP23017 library to be installed.
*
*     Created using the Arduino IDE with ESP32 module installed, no additional libraries required
*        ESP32 support for Arduino IDE: https://raw.githubusercontent.com/espressif/arduino-esp32/gh-pages/package_esp32_index.json
*
*     Info on the esp32cam board:  https://randomnerdtutorials.com/esp32-cam-video-streaming-face-recognition-arduino-ide/
*                                  https://github.com/espressif/esp32-camera
*
*     To see a more advanced sketch along the same format as this one have a look at https://github.com/alanesq/CameraWifiMotion
*        which includes email support, FTP, OTA updates and motion detection
*
*     esp32cam-demo is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the
*        implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
*
*                                                                                 https://alanesq.github.io/
*
*******************************************************************************************************************/

#if !defined ESP32
 #error This sketch is only for an ESP32 Camera module
#endif

#include "esp_camera.h"         // https://github.com/espressif/esp32-camera
#include <Arduino.h>
#include <esp_task_wdt.h>       // watchdog timer   - see: https://iotassistant.io/esp32/enable-hardware-watchdog-timer-esp32-arduino-ide/
#include "_USER_DEFINES.h"         // user settings (wifi, OTA, etc.)
#include <WiFi.h> // ESP32

void WiFiEvent(WiFiEvent_t event, WiFiEventInfo_t info)
{
  switch (event)
  {
  case ARDUINO_EVENT_WIFI_STA_START:
    // WifiState = disconnected;
    Serial.println("Station Mode Started");
    break;
  case ARDUINO_EVENT_WIFI_STA_CONNECTED: // IP not yet assigned
    Serial.println("Connected to AP: " + String(WiFi.SSID()));
    break;
  case ARDUINO_EVENT_WIFI_STA_GOT_IP:
    Serial.print("Got IP: ");
    Serial.println(WiFi.localIP());
    // WifiState = connected;
    break;
  case ARDUINO_EVENT_WIFI_STA_DISCONNECTED:
    // WifiState = disconnected;
    Serial.print("WiFi lost connection. Reason: ");
    Serial.println(info.wifi_sta_disconnected.reason);
    // WifiReconnect();
    break;
#ifdef WIFI_USE_WPS // WPS code
  case ARDUINO_EVENT_WPS_ER_SUCCESS:
    WifiState = wps_success;
    Serial.println("WPS Successful, stopping WPS and connecting to: " + String(WiFi.SSID()));
    esp_wifi_wps_disable();
    delay(10);
    WiFi.begin();
    break;
  case ARDUINO_EVENT_WPS_ER_FAILED:
    WifiState = wps_failed;
    Serial.println("WPS Failed, retrying");
    esp_wifi_wps_disable();
    wpsInitConfig();
    esp_wifi_wps_enable(&wps_config);
    esp_wifi_wps_start(0);
    break;
  case ARDUINO_EVENT_WPS_ER_TIMEOUT:
    Serial.println("WPS Timeout, retrying");
    tfts.setTextColor(TFT_RED, TFT_BLACK);
    tfts.print("/"); // retry
    tfts.setTextColor(TFT_BLUE, TFT_BLACK);
    esp_wifi_wps_disable();
    wpsInitConfig();
    esp_wifi_wps_enable(&wps_config);
    esp_wifi_wps_start(0);
    WifiState = wps_active;
    break;
#endif
  default:
    break;
  }
}

//   ---------------------------------------------------------------------------------------------------------
// for standard ESP32-CAM AI Thinker board
// #undef ESP32CAMFREENOVE
// #undef ESP32CAMFREENOVE_S3
// #undef ESP32CAMCHINESESELLER
// #define ESP32CAMAITHINKER 1

// for Freenove ESP32-Wrover CAM Board - ESP32-CAM Dev Module 4MB Flash - 4MB PSRAM
// #undef ESP32CAMAITHINKER
// #undef ESP32CAMFREENOVE_S3
// #undef ESP32CAMCHINESESELLER
// #define ESP32CAMFREENOVE 1

// for Freenove ESP32-Wrover S3 Board - ESP32-S3-CAM Dev Module 16MB Flash - 8MB PSRAM
// #undef ESP32CAMAITHINKER
// #undef ESP32CAMFREENOVE
// #undef ESP32CAMCHINESESELLER
// #define ESP32CAMFREENOVE_S3 1

// for Chinese Seller ESP32-CAM board
#undef ESP32CAMAITHINKER
#undef ESP32CAMFREENOVE
#undef ESP32CAMFREENOVE_S3
#define ESP32CAMCHINESESELLER 1

//   ---------------------------------------------------------------------------------------------------------

#if defined(ESP32CAMFREENOVE_S3) || defined(ESP32CAMCHINESESELLER)

#include <Adafruit_NeoPixel.h> // Die Adafruit NeoPixel Bibliothek

#define LED_COUNT  1

#if defined(ESP32CAMFREENOVE_S3)
  #define LED_PIN    48
#elif defined(ESP32CAMCHINESESELLER)
  #define LED_PIN    33
#endif

#define RMT_CHANNEL 0

