Martinius79/esp32cam-demo/src/main.cpp
Adafruit_NeoPixel strip(LED_COUNT, LED_PIN, NEO_GRB + NEO_KHZ800);

// Globale Variablen für den nicht-blockierenden Regenbogen-Effekt
static unsigned long previousMillisRainbow = 0;
const long rainbowInterval = 100; // Aktualisierungsintervall für den Regenbogen in ms
static long currentRainbowHue = 0; // Aktueller Farbton für den Regenbogen

// void colorWipe(uint32_t color, int wait);
void updateRainbow();

#endif //ESP32CAMFREENOVE_S3

#if defined(ESP32CAMCHINESESELLER)

#include <driver/i2s.h>
#include "driver/gpio.h" // For GPIO_NUM_X definitions

// I2S Pins for the MSM261S4030H0R Microphone
// Based on your input: SD = GPIO35, SCK = GPIO36, WS = GPIO37
#define I2S_SCK_PIN       GPIO_NUM_36
#define I2S_WS_PIN        GPIO_NUM_37
#define I2S_SD_PIN        GPIO_NUM_35

// I2S Configuration
#define SAMPLE_RATE       16000     // Typical sample rate for speech (Hz)
#define BITS_PER_SAMPLE   I2S_BITS_PER_SAMPLE_16BIT // 16 bits per sample
#define CHANNELS          I2S_CHANNEL_MONO        // Mono microphone

// Buffer to store audio data
const int SAMPLE_BUFFER_SIZE = 1024; // Number of 16-bit samples
int16_t sampleBuffer[SAMPLE_BUFFER_SIZE];

void setupMicrophone() {
  i2s_config_t i2s_config = {
    .mode = (i2s_mode_t)(I2S_MODE_MASTER | I2S_MODE_RX), // Master mode, receive mode
    .sample_rate = SAMPLE_RATE,
    .bits_per_sample = BITS_PER_SAMPLE,
    // I2S_CHANNEL_FMT_RIGHT_LEFT for stereo, but for mono, it often depends on how the microphone sends data.
    // For many digital microphones, LEFT_RIGHT or RIGHT_LEFT is fine.
    .channel_format = I2S_CHANNEL_FMT_RIGHT_LEFT,
    .communication_format = I2S_COMM_FORMAT_STAND_I2S, // Standard I2S format
    .intr_alloc_flags = ESP_INTR_FLAG_LEVEL1, // Interrupt flags
    .dma_buf_count = 8, // Number of DMA buffers
    .dma_buf_len = 64,  // Size of each DMA buffer in samples (not bytes)
    .use_apll = false,  // Do not use APLL (standard PLL is usually sufficient)
    .tx_desc_auto_clear = false // Not relevant for RX
  };

  i2s_pin_config_t pin_config = {
    .mck_io_num = I2S_PIN_NO_CHANGE,      // Master clock not used
    .bck_io_num = I2S_SCK_PIN,            // Bit Clock
    .ws_io_num = I2S_WS_PIN,              // Word Select (Left/Right Clock)
    .data_out_num = I2S_PIN_NO_CHANGE,    // No Data Output for microphone
    .data_in_num = I2S_SD_PIN             // Serial Data Input
  };

  // Install the I2S driver for I2S_NUM_0 port
  esp_err_t err = i2s_driver_install(I2S_NUM_0, &i2s_config, 0, NULL);
  if (err != ESP_OK) {
    Serial.printf("Error installing I2S driver: 0x%x\n", err);
    return;
  }

  // Set the pin configuration
  err = i2s_set_pin(I2S_NUM_0, &pin_config);
  if (err != ESP_OK) {
    Serial.printf("Error setting I2S pins: 0x%x\n", err);
    return;
  }
  
  Serial.println("Microphone (I2S) initialized.");
}

void readMicrophoneData() {
  size_t bytes_read;
  esp_err_t err = i2s_read(I2S_NUM_0, (char *)sampleBuffer, SAMPLE_BUFFER_SIZE * sizeof(int16_t), &bytes_read, portMAX_DELAY);
  
  if (err == ESP_OK && bytes_read > 0) {
    // Process the audio data in sampleBuffer

    
    // For example, you can print the first few samples
    // Serial.print("Read ");
    // Serial.print(bytes_read / sizeof(int16_t));
    // Serial.println(" samples from I2S microphone.");
    
    // for (int i = 0; i < 10 && i < bytes_read / sizeof(int16_t); i++) {
    //   Serial.print(sampleBuffer[i]);
    //   Serial.print(" ");
    // }
    // Serial.println();

    // int16_t minVal = sampleBuffer[0];
    // int16_t maxVal = sampleBuffer[0];
    // int32_t sum = 0;
    // for (int i = 0; i < bytes_read / sizeof(int16_t); i++) {
    //   int16_t v = sampleBuffer[i];
    //   if (v < minVal) minVal = v;
    //   if (v > maxVal) maxVal = v;
    //   sum += v;
    // }
    // float avg = sum / float(bytes_read / sizeof(int16_t));
    // Serial.printf("Min: %d, Max: %d, Avg: %.2f\n", minVal, maxVal, avg);
    // Serial.println();
  } else {
    Serial.printf("Error reading I2S data: 0x%x\n", err);
  }
}

#endif

//   ---------------------------------------------------------------------------------------------------------


//                          ====================================== 
//                                   Enter your wifi settings
//                          ====================================== 



// Now in _USER_DEFINES.h file         



//   ---------------------------------------------------------------------------------------------------------

    // Required by PlatformIO

    // forward declarations
      bool initialiseCamera(bool);            // this sets up and enables the camera (if bool=1 standard settings are applied but 0 allows you to apply custom settings)
      bool cameraImageSettings(bool);         // this applies the image settings to the camera (brightness etc.)
      void changeResolution(framesize_t);     // change camera resolution
      String localTime();                     // returns the current time as a String
      void flashLED(int);                     // flashes the onboard indicator led
      byte storeImage();                      // stores an image in Spiffs or SD card
      void handleRoot();                      // the root web page
      void handlePhoto();                     // web page to capture an image from camera and save to spiffs or sd card
      bool handleImg();                       // Display a previously stored image 
      void handleNotFound();                  // if invalid web page is requested
      void readRGBImage();                    // demo capturing an image and reading its raw RGB data
      bool getNTPtime(int);                   // handle the NTP real time clock
      bool handleJPG();                       // display a raw jpg image
      void handleJpeg();                      // display a raw jpg image which periodically refreshes
      void handleStream();                    // stream live video (note: this can get the camera very hot)
      int requestWebPage(String*, String*, int);  // procedure allowing the sketch to read a web page its self
      void handleTest();                      // test procedure for experimenting with bits of code etc.
      void handlePing();
      void handleReboot();                    // handle request to restart device
      void handleSwitch();
      void handleData();                      // the root web page requests this periodically via Javascript in order to display updating information
      void readGrayscaleImage();              // demo capturing a grayscale image and reading its raw RGB data
      void resize_esp32cam_image_buffer(uint8_t*, int, int, uint8_t*, int, int);    // this resizes a captured grayscale image (used by above)


// ---------------------------------------------------------------
//                           -SETTINGS
// ---------------------------------------------------------------

 const char* stitle = "BackCam";                             // title of this sketch
 const char* sversion = "01Apr25";                            // Sketch version
 
 framesize_t FRAME_SIZE_IMAGE = FRAMESIZE_SVGA;         // default camera resolution
    //           Resolutions available:
    //               160x120 (QQVGA), 128x160 (QQVGA2), 176x144 (QCIF), 240x176 (HQVGA), 240X240,
    //               320x240 (QVGA), 400x296 (CIF), 640x480 (VGA default), 800x600 (SVGA),
    //               1024x768 (XGA), 1280x1024 (SXGA), 1600x1200 (UXGA)

 #define WDT_TIMEOUT 60                                 // timeout of watchdog timer (seconds) 

 const bool sendRGBfile = 0;                            // if set to 1 '/rgb' will just return raw rgb data which can then be saved as a file rather than display a HTML pag

 uint16_t dataRefresh = 2;                              // how often to refresh data on root web page (seconds)
 uint16_t imagerefresh = 2;                             // how often to refresh the image on root web page (seconds)

 const bool serialDebug = 1;                            // show debug info. on serial port (1=enabled, disable if using pins 1 and 3 as gpio)
 const int serialSpeed = 115200;                        // Serial data speed to use

 #define useMCP23017 0                                  // set if MCP23017 IO expander chip is being used (on pins 12 and 13)

