Martinius79/esp32cam-demo/src/main.cpp
 // Camera related
   bool flashRequired = 0;                              // If flash to be used when capturing image (1 = yes)
   int cameraImageExposure = 0;                         // Camera exposure (0 - 1200)   If gain and exposure both set to zero then auto adjust is enabled
   int cameraImageGain = 0;                             // Image gain (0 - 30)
   int cameraImageBrightness = 0;                       // Image brightness (-2 to +2)
   const int camChangeDelay = 200;                      // delay when deinit camera executed

 const int TimeBetweenStatus = 600;                     // speed of flashing system running ok status light (milliseconds)

// #if !defined(ESP32CAMFREENOVE_S3) && !defined(ESP32CAMFREENOVE)
//  const int indicatorLED = 33;                           // onboard small LED pin (33)
// #else
//  // for Freenove ESP32-WROVER and WROVER-S3 Board
//  const int indicatorLED = 2;                        // onboard small LED pin (2) - not used in this sketch 
// #endif
 const bool flashIndicatorLED = 1;                      // use On-Board LED for flashing, to indicate camera is operating
 

 // Bright LED (Flash)
#if !defined(ESP32CAMFREENOVE_S3) && !defined(ESP32CAMFREENOVE) && !defined(ESP32CAMCHINESESELLER)
  const int brightLED = 4;                             // onboard Illumination/flash LED pin (4)
#endif
  int brightLEDbrightness = 0;                         // initial brightness (0 - 255)
  const int ledFreq = 5000;                            // PWM settings
  const int ledChannel = 15;                           // camera uses timer1
  const int ledRresolution = 8;                        // resolution (8 = from 0 to 255)

#if !defined(ESP32CAMFREENOVE_S3) && !defined(ESP32CAMFREENOVE) && !defined(ESP32CAMCHINESESELLER)
  const int iopinA = 13;                                 // general io pin 13
  const int iopinB = 12;                                 // general io pin 12 (must not be high at boot)
#endif


#if defined(ESP32CAMAITHINKER)
// camera settings (for the standard - OV2640 - CAMERA_MODEL_AI_THINKER)
// see: https://randomnerdtutorials.com/esp32-cam-camera-pin-gpios/
// set camera resolution etc. in 'initialiseCamera()' and 'cameraImageSettings()'
  #define CAMERA_MODEL_AI_THINKER
  #define PWDN_GPIO_NUM     32      // power to camera (on/off)
  #define RESET_GPIO_NUM    -1      // -1 = not used
  #define XCLK_GPIO_NUM      0
  #define SIOD_GPIO_NUM     26      // i2c sda
  #define SIOC_GPIO_NUM     27      // i2c scl

  #define Y9_GPIO_NUM       35
  #define Y8_GPIO_NUM       34
  #define Y7_GPIO_NUM       39
  #define Y6_GPIO_NUM       36
  #define Y5_GPIO_NUM       21
  #define Y4_GPIO_NUM       19
  #define Y3_GPIO_NUM       18
  #define Y2_GPIO_NUM        5

  #define VSYNC_GPIO_NUM    25      // vsync_pin
  #define HREF_GPIO_NUM     23      // href_pin
  #define PCLK_GPIO_NUM     22      // pixel_clock_pin

  // Single color LED
  #define LED_GPIO_NUM      33


#elif defined(ESP32CAMCHINESESELLER)
  //Chinese Seller

  //Camera settings
  #define PWDN_GPIO_NUM    -1
  #define RESET_GPIO_NUM   -1
  #define XCLK_GPIO_NUM    10
  #define SIOD_GPIO_NUM    21
  #define SIOC_GPIO_NUM    14

  #define Y9_GPIO_NUM      11
  #define Y8_GPIO_NUM      9
  #define Y7_GPIO_NUM      8
  #define Y6_GPIO_NUM      6
  #define Y5_GPIO_NUM      4
  #define Y4_GPIO_NUM      2
  #define Y3_GPIO_NUM      3
  #define Y2_GPIO_NUM      5

  #define VSYNC_GPIO_NUM   13
  #define HREF_GPIO_NUM    12
  #define PCLK_GPIO_NUM    7

  // Single color LED
  #define LED_GPIO_NUM     34

  // SD Card
  #define SDMMC_SLOT_CMD   39
  #define SDMMC_SLOT_CLK   42
  #define SDMMC_SLOT_D0    41
  #define SDMMC_SLOT_D1    40
  #define SDMMC_SLOT_D2    37
  #define SDMMC_SLOT_D3    38

#elif defined(ESP32CAMFREENOVE)
  // camera settings (for the Freenove ESP32-Wrover CAM Board Clone - ESP32-CAM Dev Module 4MB Flash - 4MB PSRAM
  // CAMERA_MODEL_WROVER_KIT  
  #define CAMERA_MODEL_WROVER_KIT
  #define PWDN_GPIO_NUM    -1
  #define RESET_GPIO_NUM   -1
  #define XCLK_GPIO_NUM    21
  #define SIOD_GPIO_NUM    26
  #define SIOC_GPIO_NUM    27
  // SDMMC_SLOT_NO_CD

  #define Y9_GPIO_NUM      35
  #define Y8_GPIO_NUM      34
  #define Y7_GPIO_NUM      39
  #define Y6_GPIO_NUM      36
  #define Y5_GPIO_NUM      19
  #define Y4_GPIO_NUM      18
  #define Y3_GPIO_NUM       5
  #define Y2_GPIO_NUM       4

  #define VSYNC_GPIO_NUM   25
  #define HREF_GPIO_NUM    23
  #define PCLK_GPIO_NUM    22

  // Single color LED
  #define LED_GPIO_NUM     2

#elif defined(ESP32CAMFREENOVE_S3)
  #define PWDN_GPIO_NUM   -1
  #define RESET_GPIO_NUM  -1
  #define XCLK_GPIO_NUM   15
  #define SIOD_GPIO_NUM   4
  #define SIOC_GPIO_NUM   5

  #define Y2_GPIO_NUM     11
  #define Y3_GPIO_NUM     9
  #define Y4_GPIO_NUM     8
  #define Y5_GPIO_NUM     10
  #define Y6_GPIO_NUM     12
  #define Y7_GPIO_NUM     18
  #define Y8_GPIO_NUM     17
  #define Y9_GPIO_NUM     16

  #define VSYNC_GPIO_NUM  6
  #define HREF_GPIO_NUM   7
  #define PCLK_GPIO_NUM   13

  #define LED_GPIO_NUM    2

#else
//"Camera model not selected"
#endif // ESP32CAM PinOut Select

camera_config_t config;           // camera settings


// ******************************************************************************************************************


//#include "esp_camera.h"         // https://github.com/espressif/esp32-camera
// #include "camera_pins.h"
#include <WString.h>            // this is required for base64.h otherwise get errors with esp32 core 1.0.6 - jan23
#include <base64.h>             // for encoding buffer to display image on page
#include <WiFi.h>
#include <WebServer.h>
#include <HTTPClient.h>
#include "driver/ledc.h"        // used to configure pwm on illumination led

// NTP - Internet time - see - https://randomnerdtutorials.com/esp32-ntp-timezones-daylight-saving/
  #include "time.h"
  struct tm timeinfo;
  const char* ntpServer = "pool.ntp.org";
  const char* TZ_INFO    = "CET-1CEST-2,M3.5.0/02:00:00,M10.5.0/03:00:00";  // enter your time zone (https://remotemonitoringsystems.ca/time-zone-abbreviations.php)
  long unsigned lastNTPtime;
  time_t now;
   
// spiffs used to store images if no sd card present
 #include <SPIFFS.h>
 #include <FS.h>                               // gives file access on spiffs

