Martinius79/esp32cam-demo/src/main.cpp
WebServer server(80);                          // serve web pages on port 80

// Used to disable brownout detection
 #include "soc/soc.h"
 #include "soc/rtc_cntl_reg.h"

// sd-card
 #include "SD_MMC.h"                           // sd card - see https://randomnerdtutorials.com/esp32-cam-take-photo-save-microsd-card/
 #include <SPI.h>
 #include <FS.h>                               // gives file access
 #define SD_CS 5                               // sd chip select pin = 5

// MCP23017 IO expander on pins 12 and 13 (optional)
 #if useMCP23017 == 1
   #include <Wire.h>
   #include "Adafruit_MCP23017.h"
   Adafruit_MCP23017 mcp;
   // Wire.setClock(1700000);                  // set frequency to 1.7mhz
 #endif

// Define some global variables:
 uint32_t lastStatus = millis();               // last time status light changed status (to flash all ok led)
 bool sdcardPresent;                           // flag if an sd card is detected
 int imageCounter;                             // image file name on sd card counter
 const String spiffsFilename = "/image.jpg";   // image name to use when storing in spiffs
 String ImageResDetails = "Unknown";           // image resolution info
 int currentRes = 0;                           // current selected camera resolution

// OTA Stuff
  bool OTAEnabled = 0;                         // flag to show if OTA has been enabled (via supply of password in http://x.x.x.x/ota)
  #if ENABLE_OTA
      void sendHeader(WiFiClient &client, const char* hTitle);      // forward declarations
      void sendFooter(WiFiClient &client);
      #include "ota.h"                         // Over The Air updates (OTA)
  #endif

// ---------------------------------------------------------------
//    -SETUP     SETUP     SETUP     SETUP     SETUP     SETUP
// ---------------------------------------------------------------

void setup() {

 if (serialDebug) {
   Serial.begin(serialSpeed);                     // Start serial communication
   delay(2000);                               // give time for serial to start

   Serial.setDebugOutput(true);

   Serial.printf("Free heap: %u bytes\n", ESP.getFreeHeap());
   Serial.printf("Free PSRAM: %u bytes\n", ESP.getFreePsram());

   Serial.println("\n");                      // line feed
   Serial.println("-----------------------------------");
   Serial.printf("Starting - %s - %s \n", stitle, sversion);
   Serial.println("-----------------------------------");
  //  delay(10000);                               // give time for serial to start
   // Serial.print("Reset reason: " + ESP.getResetReason());
 }

 #if !defined(ESP32CAMFREENOVE_S3)
 WRITE_PERI_REG(RTC_CNTL_BROWN_OUT_REG, 0);     // Turn-off the 'brownout detector'
 #endif

#if defined(ESP32CAMFREENOVE_S3) || defined(ESP32CAMCHINESESELLER)
  // Initialisiere die NeoPixel-Bibliothek
  strip.begin();
  // Setze alle LEDs auf "Aus" und aktualisiere die Anzeige
  strip.show();
  Serial.println("Adafruit NeoPixel Beispiel gestartet!");
#endif

#if defined(ESP32CAMCHINESESELLER)
  // Initialize the I2S microphone
  setupMicrophone();
  Serial.println("I2S Microphone initialized.");
#endif

// small indicator led on rear of esp32cam board
// #if !defined(ESP32CAMFREENOVE_S3) && !defined(ESP32CAMFREENOVE)
   pinMode(LED_GPIO_NUM, OUTPUT);
   digitalWrite(LED_GPIO_NUM,HIGH);
   delay(200);                               // give time for led to turn on
   // small indicator led on
   digitalWrite(LED_GPIO_NUM,LOW);
// #endif


if (SSID_NAME == nullptr) {
  if (serialDebug) Serial.println("Error: SSID_NAME not set!");
  while(1); // Stop
}
if (SSID_PASSWORD == nullptr) {
  if (serialDebug) Serial.println("Error: SSID_PASSWORD not set!");
  while(1); // Stop
}

// Connect to wifi
if (serialDebug) {
  Serial.print("\nConnecting to ");
  Serial.print(SSID_NAME);
  Serial.print("\n   ");
}

  Serial.println("Connecting to WiFi...");
  WiFi.disconnect(true);                        // disconnect from any previous connection
  delay(1000);                                 // give time to disconnect 
  // print wifi status
  if (serialDebug) {
    //print password if it is set
    if (SSID_PASSWORD != nullptr && SSID_PASSWORD[0] !='\0') {
      Serial.print("SSID: ");
      Serial.println(SSID_NAME);
      Serial.print("Password: ");
      Serial.println(SSID_PASSWORD);
    } else {
      Serial.println("SSID: " + String(SSID_NAME));
      Serial.println("Password: not set");
    }
  }

  
  WiFi.mode(WIFI_STA);                          // set wifi mode to station
  WiFi.begin(SSID_NAME, SSID_PASSWORD);
  WiFi.onEvent(WiFiEvent);
  WiFi.config(INADDR_NONE, INADDR_NONE, INADDR_NONE, INADDR_NONE);
  WiFi.setHostname("ESP32-TRYOUT"); // set hostname for mDNS

  if (WiFi.status() == WL_CONNECT_FAILED) {
    if (serialDebug) Serial.println("WiFi connection failed");
  }

  unsigned long StartTime = millis();
  while (WiFi.status() != WL_CONNECTED) {
      delay(500); // print a dot every 500ms to show we are still trying to connect
      if ((millis() - StartTime) > (20 * 1000))
      {    
        Serial.println("\r\nWiFi connection timeout!");
        break; // exit loop, exit procedure, continue clock startup
      }
      if (serialDebug) Serial.print(".");
  }

  if (serialDebug) {
    Serial.print("\nWiFi connected, ");
    Serial.print("IP address: ");
    Serial.println(WiFi.localIP());
  }
  server.enableCORS();   // allow html to request pages without it being blocked
  server.begin();                               // start web server
// #if !defined(ESP32CAMFREENOVE_S3) && !defined(ESP32CAMFREENOVE)
   digitalWrite(LED_GPIO_NUM,HIGH);              // small indicator led off
// #endif

 // define the web pages (i.e. call these procedures when url is requested)
   server.on("/", handleRoot);                   // root page
   server.on("/data", handleData);               // suplies data to periodically update root (AJAX)
   server.on("/jpg", handleJPG);                 // capture image and send as jpg
   server.on("/jpeg", handleJpeg);                // show updating image
   server.on("/stream", handleStream);           // stream live video
   server.on("/photo", handlePhoto);             // save image to sd card
   server.on("/img", handleImg);                 // show image from sd card
   server.on("/rgb", readRGBImage);              // demo converting image to RGB
   server.on("/graydata", readGrayscaleImage);   // look at grayscale image data
   server.on("/test", handleTest);               // Testing procedure
   server.on("/reboot", handleReboot);           // restart device
   server.on("/ping", handlePing);               // for checking camera is responding
   server.on("/switch", handleSwitch);           // switch gpio pin via a url
   server.onNotFound(handleNotFound);            // invalid url requested
#if ENABLE_OTA   
  server.on("/ota", handleOTA);                 // ota updates web page
#endif  

 // NTP - internet time
   if (serialDebug) Serial.println("\nGetting real time (NTP)");
   configTime(0, 0, ntpServer);
   setenv("TZ", TZ_INFO, 1);
   if (getNTPtime(10)) {  // wait up to 10 sec to sync
   } else {
     if (serialDebug) Serial.println("Time not set");
   }
   lastNTPtime = time(&now);

 // set up camera
     if (serialDebug) Serial.print(("\nInitialising camera: "));
     if (initialiseCamera(1)) {           // apply settings from 'config' and start camera
       if (serialDebug) Serial.println("OK");
     }
     else {
       if (serialDebug) Serial.println("failed");
     }

