Martinius79/esp32cam-demo/src/main.cpp
 // Spiffs - for storing images without an sd card
 //       see: https://circuits4you.com/2018/01/31/example-of-esp8266-flash-file-system-spiffs/
   if (!SPIFFS.begin(true)) {
     if (serialDebug) Serial.println(("An Error has occurred while mounting SPIFFS - restarting"));
     delay(5000);
     ESP.restart();                               // restart and try again
     delay(5000);
   } else {
     // SPIFFS.format();      // wipe spiffs
     delay(5000);
     if (serialDebug) {
       Serial.print(("SPIFFS mounted successfully: "));
       Serial.printf("total bytes: %d , used: %d \n", SPIFFS.totalBytes(), SPIFFS.usedBytes());
     }
   }

   // Freenove ESPs boards don't have an sd card slot, so skip sd card setup and set to no sd card present
#if defined ESP32CAMFREENOVE_S3 || defined ESP32CAMFREENOVE
   if (serialDebug) Serial.println("No SD Card on this board!");
   sdcardPresent = 0;                        // flag no sd card available
#else

    // SD Card - if one is detected set 'sdcardPresent' High
#if defined (ESP32CAMCHINESESELLER)
      SD_MMC.setPins(SDMMC_SLOT_CLK, SDMMC_SLOT_CMD, SDMMC_SLOT_D0, SDMMC_SLOT_D1, SDMMC_SLOT_D2, SDMMC_SLOT_D3);
#endif

    if (!SD_MMC.begin("/sdcard", true)) {        // if loading sd card fails
      // note: ('/sdcard", true)' = 1bit mode - see: https://dr-mntn.net/2021/02/using-the-sd-card-in-1-bit-mode-on-the-esp32-cam-from-ai-thinker
      if (serialDebug) Serial.println("No SD Card detected");
      sdcardPresent = 0;                        // flag no sd card available
    } else {
      uint8_t cardType = SD_MMC.cardType();
      if (cardType == CARD_NONE) {              // if invalid card found
          if (serialDebug) Serial.println("SD Card type detect failed");
          sdcardPresent = 0;                    // flag no sd card available
      } else {
        // valid sd card detected
        uint16_t SDfreeSpace = (uint64_t)(SD_MMC.totalBytes() - SD_MMC.usedBytes()) / (1024 * 1024);
        if (serialDebug) Serial.printf("SD Card found, free space = %dmB \n", SDfreeSpace);
        sdcardPresent = 1;                      // flag sd card available
      }
    }
#endif // #if defined ESP32CAMFREENOVE_S3 || defined ESP32CAMFREENOVE
     fs::FS &fs = SD_MMC;                        // sd card file system

 // discover the number of image files already stored in '/img' folder of the sd card and set image file counter accordingly
   imageCounter = 0;
   if (sdcardPresent) {
     int tq=fs.mkdir("/img");                    // create the '/img' folder on sd card (in case it is not already there)
     if (!tq) {
       if (serialDebug) Serial.println("Unable to create IMG folder on sd card");
     }

     // open the image folder and step through all files in it
       File root = fs.open("/img");
       while (true)
       {
           File entry =  root.openNextFile();    // open next file in the folder
           if (!entry) break;                    // if no more files in the folder
           imageCounter ++;                      // increment image counter
           entry.close();
       }
       root.close();
       if (serialDebug) Serial.printf("Image file count = %d \n",imageCounter);
   }

// #if !defined(ESP32CAMFREENOVE_S3) && !defined(ESP32CAMFREENOVE)
  // define i/o pins
  pinMode(LED_GPIO_NUM, OUTPUT);            // defined again as sd card config can reset it
  digitalWrite(LED_GPIO_NUM,HIGH);          // led off = High
// #endif
#if !defined(ESP32CAMFREENOVE_S3) && !defined(ESP32CAMFREENOVE) && !defined(ESP32CAMCHINESESELLER)
   pinMode(iopinA, INPUT);                   // pin 13 - free io pin, can be used for input or output
   pinMode(iopinB, OUTPUT);                  // pin 12 - free io pin, can be used for input or output (must not be high at boot)
#endif

 // MCP23017 io expander (requires adafruit MCP23017 library)
 #if useMCP23017 == 1
   Wire.begin(12,13);             // use pins 12 and 13 for i2c
   mcp.begin(&Wire);              // use default address 0
   mcp.pinMode(0, OUTPUT);        // Define GPA0 (physical pin 21) as output pin
   mcp.pinMode(8, INPUT);         // Define GPB0 (physical pin 1) as input pin
   mcp.pullUp(8, HIGH);           // turn on a 100K pullup internally
   // change pin state with   mcp.digitalWrite(0, HIGH);
   // read pin state with     mcp.digitalRead(8)
 #endif

#if !defined(ESP32CAMFREENOVE_S3) && !defined(ESP32CAMFREENOVE) && !defined(ESP32CAMCHINESESELLER)
// configure PWM for the illumination LED
  pinMode(brightLED, OUTPUT);
  analogWrite(brightLED, brightLEDbrightness);
#endif

// ESP32 Watchdog timer -    Note: esp32 board manager v3.x.x requires different code
  #if defined ESP32
    esp_task_wdt_deinit();                  // ensure a watchdog is not already configured
    #if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR == 3
      // v3 board manager detected
        if (serialDebug) Serial.println("Watchdog timer: v3 esp32 board manager detected");
        esp_task_wdt_config_t wdt_config = {
            .timeout_ms = WDT_TIMEOUT * 1000, // Convert seconds to milliseconds
            .idle_core_mask = 1 << 0,         // Which core to monitor
            .trigger_panic = true             // Enable panic
        };
      // Initialize the WDT with the configuration structure
        esp_task_wdt_init(&wdt_config);       // Pass the pointer to the configuration structure
        esp_task_wdt_add(NULL);               // Add current thread to WDT watch    
        esp_task_wdt_reset();                 // reset timer
        if (serialDebug) Serial.println("Watchdog Timer initialized");
    #else
      // pre v3 board manager assumed
        if (serialDebug) Serial.println("Watchdog timer: Older esp32 board manager detected");
        esp_task_wdt_init(WDT_TIMEOUT, true);                      //enable panic so ESP32 restarts
        esp_task_wdt_add(NULL);                                    //add current thread to WDT watch   
    #endif
  #endif  

  // print some info on the serial port
  if (serialDebug) {
    Serial.printf("Free heap: %u bytes\n", ESP.getFreeHeap());
    Serial.printf("Free PSRAM: %u bytes\n", ESP.getFreePsram());
    Serial.printf("Sketch size: %u bytes\n", ESP.getSketchSize());
    Serial.printf("SPIFFS total bytes: %u , used: %u \n", SPIFFS.totalBytes(), SPIFFS.usedBytes());
    Serial.printf("SD Card present: %s \n", sdcardPresent ? "Yes" : "No");
  }

