Martinius79/esp32cam-demo/src/main.cpp
  // startup complete
  if (serialDebug) {
    Serial.println("\nStarted...");
  }

   // flash the indicator LED to show sketch has started
   if (serialDebug) Serial.println("Sketch started, flashing indicator LED");
// #if !defined(ESP32CAMFREENOVE_S3) && !defined(ESP32CAMFREENOVE)
   flashLED(2);     // flash the onboard indicator led
// #endif
#if !defined(ESP32CAMFREENOVE_S3) && !defined(ESP32CAMFREENOVE) && !defined(ESP32CAMCHINESESELLER)
   analogWrite(brightLED, 64);    // change bright LED
   delay(200);
   analogWrite(brightLED, 0);    // change bright LED
#endif

}  // setup








// // --------------------------------------------------------------------------------------------------------------------
// //   -LOOP     LOOP     LOOP     LOOP     LOOP     LOOP     LOOP
// // --------------------------------------------------------------------------------------------------------------------


void loop() {
// Serial.println("Looping...");
 server.handleClient();          // handle any incoming web page requests

#if defined(ESP32CAMFREENOVE_S3) || defined(ESP32CAMCHINESESELLER)
  // Handle NeoPixel animations
  updateRainbow(); // Rainbow animation with a delay of 100 milliseconds
#endif

#if defined(ESP32CAMCHINESESELLER)
  // Handle I2S microphone data
  readMicrophoneData(); // Read microphone data and process it
#endif

 //                           <<< YOUR CODE HERE >>>


//  //  Capture an image and save to sd card every 5 seconds (i.e. time lapse)
//      static uint32_t lastCamera = millis();
//      if ( ((unsigned long)(millis() - lastCamera) >= 5000) && sdcardPresent ) {
//        lastCamera = millis();     // reset timer
//        storeImage();              // save an image to sd card
//        if (serialDebug) Serial.println("Time lapse image captured");
//      }

 // flash status LED to show sketch is running ok
   if ((unsigned long)(millis() - lastStatus) >= TimeBetweenStatus) {
     lastStatus = millis();                                               // reset timer
     esp_task_wdt_reset();                                                // reset watchdog timer (to prevent system restart)
// #if !defined(ESP32CAMFREENOVE_S3) && !defined(ESP32CAMFREENOVE)
    if (flashIndicatorLED) digitalWrite(LED_GPIO_NUM,!digitalRead(LED_GPIO_NUM));     // flip indicator led status
// #endif
   }

}  // loop
//   Add your code here to handle camera operations, web server requests, etc.
// }










// *******************************************************************************************************************************************




// ----------------------------------------------------------------
//                        Initialise the camera
// ----------------------------------------------------------------
// returns TRUE if successful
// reset - if set to 1 all settings are reconfigured
//         if set to zero you can change the settings and call this procedure to apply them

bool initialiseCamera(bool reset) {

// set the camera parameters in 'config'
if (reset) {
   config.ledc_channel = LEDC_CHANNEL_0;
   config.ledc_timer = LEDC_TIMER_0;
   config.pin_d0 = Y2_GPIO_NUM;
   config.pin_d1 = Y3_GPIO_NUM;
   config.pin_d2 = Y4_GPIO_NUM;
   config.pin_d3 = Y5_GPIO_NUM;
   config.pin_d4 = Y6_GPIO_NUM;
   config.pin_d5 = Y7_GPIO_NUM;
   config.pin_d6 = Y8_GPIO_NUM;
   config.pin_d7 = Y9_GPIO_NUM;
   config.pin_xclk = XCLK_GPIO_NUM;
   config.pin_pclk = PCLK_GPIO_NUM;
   config.pin_vsync = VSYNC_GPIO_NUM;
   config.pin_href = HREF_GPIO_NUM;
   // Use recommended naming for sccb communication
   config.pin_sccb_sda = SIOD_GPIO_NUM;    // recommended
   config.pin_sccb_scl = SIOC_GPIO_NUM;
   config.pin_pwdn = PWDN_GPIO_NUM;
   config.pin_reset = RESET_GPIO_NUM;   
   config.pin_pwdn = PWDN_GPIO_NUM;
   config.pin_reset = RESET_GPIO_NUM;
   config.xclk_freq_hz = 10000000;               // XCLK 20MHz or 10MHz for OV2640 double FPS (Experimental)
   config.pixel_format = PIXFORMAT_JPEG;                         // colour jpg format
   config.frame_size = FRAME_SIZE_IMAGE;         // Image sizes: 160x120 (QQVGA), 128x160 (QQVGA2), 176x144 (QCIF), 240x176 (HQVGA), 320x240 (QVGA),
                                                 //              400x296 (CIF), 640x480 (VGA, default), 800x600 (SVGA), 1024x768 (XGA), 1280x1024 (SXGA),
                                                 //              1600x1200 (UXGA)
   config.jpeg_quality = 10;                     // 0-63 lower number means higher quality (can cause failed image capture if set too low at higher resolutions)
   config.grab_mode = CAMERA_GRAB_WHEN_EMPTY;
   //config.fb_location = CAMERA_FB_IN_PSRAM;      // store the captured frame in PSRAM
   config.fb_count = 1;                          // if more than one, i2s runs in continuous mode. Use only with JPEG
}

   // check the esp32cam board has a psram chip installed (extra memory used for storing captured images)
   //    Note: if not using "AI thinker esp32 cam" in the Arduino IDE, PSRAM must be enabled
    if (!psramFound()) {
      if (serialDebug) Serial.println("Warning: No PSRam found so defaulting to smaller image size 'VGA' in DRAM");
      config.frame_size = FRAMESIZE_VGA;     
      config.fb_location = CAMERA_FB_IN_DRAM;
    } else {
      // If PSRAM IS found, explicitly set fb_location  
      config.fb_location = CAMERA_FB_IN_PSRAM;
    }

   esp_err_t camerr = esp_camera_init(&config);  // initialise the camera
   if (camerr != ESP_OK) {
     if (serialDebug) Serial.printf("ERROR: Camera init failed with error 0x%x", camerr); 
     return 0;                          // return false if camera initialisation failed
   }

   cameraImageSettings(0);                       // apply the camera image settings

   return (camerr == ESP_OK);                    // return boolean result of camera initialisation
}


// ----------------------------------------------------------------
//                   -Change camera image settings
// ----------------------------------------------------------------
// Adjust image properties (brightness etc.)
// Defaults to auto adjustments if exposure and gain are both set to zero
// if 'flush' is set then several frames are captured to ensure settings take effect straight away
// - Returns TRUE if successful
// More info: https://randomnerdtutorials.com/esp32-cam-ov2640-camera-settings/
//            interesting info on exposure times here: https://github.com/raduprv/esp32-cam_ov2640-timelapse

bool cameraImageSettings(bool flush) {   

  if (serialDebug) Serial.println("Applying camera settings");

   sensor_t *s = esp_camera_sensor_get();
   // printf("Sensor ID: 0x%x\n", s->id.PID);  // print sensor id to serial port
   if (serialDebug) Serial.printf("Sensor ID: 0x%x\n", s->id.PID);  // print sensor id to serial port
   // something to try?:     if (s->id.PID == OV3660_PID)
   if (s == NULL) {
     if (serialDebug) Serial.println("Error: problem reading camera sensor settings");
     return 0;
   }

   // if both set to zero enable auto adjust
   if (cameraImageExposure == 0 && cameraImageGain == 0) {
     // enable auto adjust
       s->set_gain_ctrl(s, 1);                       // auto gain on
       s->set_exposure_ctrl(s, 1);                   // auto exposure on 
       s->set_saturation(s, -1);                     // Slightly decrease saturation
       s->set_contrast(s, -1);                       // Slightly decrease contrast
       s->set_whitebal(s, 1);                        // Enable white balance
       s->set_awb_gain(s, 1);                        // Auto White Balance enable (0 or 1)
       s->set_brightness(s, cameraImageBrightness);  // (-2 to 2) - set brightness
   } else {
     // Apply manual settings
       s->set_gain_ctrl(s, 0);                       // auto gain off
       s->set_whitebal(s, 1);                        // Enable white balance
       s->set_awb_gain(s, 1);                        // Auto White Balance enable (0 or 1)
       s->set_saturation(s, -1);                     // Slightly decrease saturation
       s->set_contrast(s, -1);                       // Slightly decrease contrast
       s->set_whitebal(s, 1);                        // Enable auto white balanc
       s->set_exposure_ctrl(s, 0);                   // auto exposure off
       s->set_brightness(s, cameraImageBrightness);  // (-2 to 2) - set brightness
       s->set_agc_gain(s, cameraImageGain);          // set gain manually (0 - 30)
       s->set_aec_value(s, cameraImageExposure);     // set exposure manually  (0-1200)
   }
   
