Martinius79/esp32cam-demo/src/main.cpp
/*
 // demo of how to request a web page
   String page = "http://urlhere.com";   // url to request
   String response;                             // reply will be stored here
   int httpCode = requestWebPage(&page, &response);
   // show results
     client.println("Web page requested: '" + page + "' - http code: " + String(httpCode));
     client.print("<xmp>'");     // enables the html code to be displayed
     client.print(response);
     client.println("'</xmp><br>");
*/


/*
//  // demo useage of the mcp23017 io chipnote: this stops PWM on the flash working for some reason
    #if useMCP23017 == 1
      while(1) {
          mcp.digitalWrite(0, HIGH);
          int q = mcp.digitalRead(8);
          client.print("<p>HIGH, input =" + String(q) + "</p>");
          delay(1000);
          mcp.digitalWrite(0, LOW);
          client.print("<p>LOW</p>");
          delay(1000);
      }
    #endif
*/


 // -------------------------------------------------------------------

 client.println("<br><br><a href='/'>Return</a>");       // link back
 sendFooter(client);     // close web page

}  // handleTest

#if defined(ESP32CAMFREENOVE_S3) || defined(ESP32CAMCHINESESELLER)
// // Hilfsfunktion: LEDs nacheinander in einer bestimmten Farbe einschalten
// // Die Adafruit Bibliothek verwendet strip.Color(R, G, B)
// void colorWipe(uint32_t color, int wait) {
//   for(int i=0; i<strip.numPixels(); i++) { // Für jede LED in der Kette
//     strip.setPixelColor(i, color);   // Setze die Farbe
//     strip.show();                    // Aktualisiere die Anzeige
//     delay(wait);                     // Warte kurz
//   }
// }

// Hilfsfunktion: Regenbogen-Effekt
// Diese Funktion verwendet die ColorHSV-Funktion der Adafruit Bibliothek
void updateRainbow() {
  unsigned long currentMillis = millis();

  // Prüfe, ob es Zeit ist, den Regenbogen-Effekt zu aktualisieren
  if (currentMillis - previousMillisRainbow >= rainbowInterval) {
    previousMillisRainbow = currentMillis; // Speichere die letzte Aktualisierungszeit

    // Aktualisiere alle Pixel für den aktuellen Farbton
    for(int i=0; i<strip.numPixels(); i++) { // Für jede LED in der Kette
      int pixelHue = currentRainbowHue + (i * 65536L / strip.numPixels());
      strip.setPixelColor(i, strip.gamma32(strip.ColorHSV(pixelHue)));
    }
    strip.show(); // Aktualisiere die LED-Leiste

    // Erhöhe den Farbton für die nächste Aktualisierung
    currentRainbowHue += 256; // Gleicher Schritt wie in der ursprünglichen Schleife
    if (currentRainbowHue >= 5 * 65536) { // Setze zurück, wenn 5 volle Zyklen erreicht sind
      Serial.println("Rainbow cycle complete, resetting hue!");
      currentRainbowHue = 0;
    }
  }
}
#endif // defined(ESP32CAMFREENOVE_S3)



// ******************************************************************************************************************
// end
